{"India win as Australia record Wankhede's lowest first-innings ODI total in 21 years": "India defeated Australia by five wickets in the first ODI at the Wankhede Stadium in Mumbai. Australia were bowled out for 188 runs in 35.4 overs. It is the lowest first-innings ODI total by any team at the Wankhede Stadium in the last 21 years. India chased down the target in 39.5 overs, driven by KL Rahul's 75*(91).", "Athiya shares video of Jadeja hugging KL Rahul after win, calls Rahul 'most resilient'": "Actress Athiya Shetty took to Instagram Stories to praise her husband, cricketer KL Rahul, after his 75*(91) helped India beat Australia by 5 wickets on Friday. \"To the most resilient person I know,\" she wrote along with a heart emoji while sharing a video of Ravindra Jadeja hugging him. India chased down the target of 189 runs in 39.5 overs.", "I've no regrets about marrying Reena Roy: Ex-Pak cricketer Mohsin Khan on divorce": "Former Pakistani cricketer Mohsin Khan, who was married to Bollywood actress Reena Roy, has said that he has no regrets on his decision to marry her. \"I had married a human being, I didn't see who she was or where she was from. But I had decided that I want to stay in Pakistan,\" Khan said about their divorce.", "Which 27 players have captained India in ODI cricket history?": "Hardik Pandya today became the 27th cricketer to captain India in ODIs. Ajit Wadekar was India’s first-ever ODI captain. Sunil Gavaskar led India in 37 ODIs from 1980-1985. MS Dhoni captained India in most number of matches (200), while Virat Kohli led India in 95 ODIs. Sourav Ganguly and Mohammed Azharuddin led India in 140-plus ODIs.", "Harbhajan's reaction to Babar Azam's 'I prefer BBL over IPL' remark goes viral": "Ex-India off-spinner Harbhajan Singh's reaction to Pakistan captain Babar Azam saying he prefers BBL over IPL has gone viral. Reacting to a tweet mentioning Babar's preference, Harbhajan reacted with a laughing emoji. Reacting to Harbhajan's viral reaction, a fan tweeted, \"When you've never tasted a mango...how can you tell its taste.\" Notably, Babar has not featured in BBL or IPL."}