{"I had promised my father I won't ever lose my dignity: Rupali Ganguly on casting couch": "'Anupamaa' actress Rupali Ganguly spoke to ETimes and shared that casting couch existed in 90s and hence she stepped out of the film industry. \"I had a film background but I had promised my father...I won't ever lose my dignity,\" she said. \"I couldn't handle how the industry worked then, especially...casting couch...I decided I can't deal with it,\" Rupali added.", "16-yr-old Indian Grandmaster R Praggnanandhaa meets Rajinikanth, shares pics": "Indian Grandmaster R Praggnanandhaa met actor Rajinikanth on Saturday and took to Twitter to share pictures. The 16-year-old met Rajinikanth ahead of the 44th Chess Olympiad, scheduled to start in Chennai on July 28. \"A day to remember!!! Met @rajinikanth uncle today with my family! Inspired by his humbleness despite reaching great heights!\" he wrote. ", "Taiwanese actor, his son hospitalised after Tesla crashes, pic of car in flames surfaces": "Taiwanese actor Jimmy Lin Chih-ying and his son have been hospitalised after the Tesla car being driven by the celebrity crashed into a pole and burst into flames. Pictures of Lin's car after the accident went viral on social media, showing the entire front ruined and badly damaged. Lin has suffered injuries to his head and shoulder, as per reports.", "I'm numb, worried for his wife & kid: Nehha on co-star Deepesh's death": "Actress Nehha Pendse, mourning the demise of 'Bhabi Ji Ghar Par Hai' co-actor Deepesh Bhan, said, \"I'm very numb right now and don't know how to react to this.\" She added that Deepesh lost his mother in November. \"Now I'm more worried for his wife and kid. The baby is too young and he got married very late,\" said Nehha. ", "'Bhabi Ji...' actors Saumya, Rohitashv pen tribute to Deepesh Bhan": "Actor Rohitashv Gour remembered 'Bhabi Ji Ghar Par Hai!' co-star Deepesh Bhan, who passed away on Saturday. \"Life is so unpredictable...yesterday, I uploaded an Instagram reel with Deepesh...today he is not here with us,\" Rohitashv wrote on Instagram. Saumya Tandon, who was a part of the show, wrote on Instagram, \"Can't believe you're gone...You were a heart of gold.\""}